## Pandas: Attributes, Methods and Functions

In [2]:
import pandas as pd
import numpy as np

In [3]:
df_exams = pd.read_csv('datasets/StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### Basic Attributes of a DataFrame

In [4]:
# Shape: (rows, cols)
df_exams.shape

(1000, 8)

In [5]:
# Index attribute
# RangeIndex(start, stop (last element), step)
df_exams.index

RangeIndex(start=0, stop=1000, step=1)

In [6]:
# Column attribute: List of name of columns
df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [7]:
# Data types of each column
# strings --> type object
df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

### Methods

In [8]:
# show first 5 rows
df_exams.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [9]:
# showing the info of the dataframe
df_exams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [10]:
# Describe basic statistics of the dataframe
# Count, Mean, Standard Deviation, Min/Max, Quartiles
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

### Functions

In [11]:
# Length (number of rows) of the dataframe
len(df_exams)

1000

In [12]:
# Highest index of the dataframe: corresponds to the last entry on the dataframe
max(df_exams.index)

999

In [13]:
# Lowest index for the dataframe
min(df_exams.index)

0

In [14]:
# Obtain the data type of the DataFrame
type(df_exams)

pandas.core.frame.DataFrame

In [15]:
# Rounding values of the dataset
round(df_exams, 2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## **Selecting columns**
### Select one column

In [16]:
# Select column with []
df_exams['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [17]:
# A column has a type of Series
type(df_exams['gender'])

pandas.core.series.Series

In [18]:
# Select column with dot notation
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

### Select two or more columns

In [19]:
  # Using the [[]] (nested square brackets)
df_exams[["test preparation course", "math score", "reading score", "writing score"]]

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                      none          47             57             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

[1000 rows x 4 columns]

In [20]:
type(df_exams[["math score", "reading score"]])

pandas.core.frame.DataFrame

In [21]:
# Nested square brackets would always return a DataFrame
type(df_exams[["test preparation course"]])

pandas.core.frame.DataFrame

## **Adding a new column**

### Using ["column"] notation

In [22]:
# Add a new column with a scalar value.
# Every row of the new column shares the same value
df_exams['language score'] = 85
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,85
1,female,group C,some college,standard,completed,69,90,88,85
2,female,group B,master's degree,standard,none,90,95,93,85
3,male,group A,associate's degree,free/reduced,none,47,57,44,85
4,male,group C,some college,standard,none,76,78,75,85
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,85
996,male,group C,high school,free/reduced,none,62,55,55,85
997,female,group C,high school,free/reduced,completed,59,71,65,85
998,female,group D,some college,standard,completed,68,78,77,85
999,female,group D,some college,free/reduced,none,77,86,86,85

In [23]:
# Add new column with an array
# The dataframe has 1000 rows, hence 1000 elements is needed

# 1000 random elements in a list in range [0, 100] ("high" argument exclusive)
lang_score = np.random.randint(0, 100+1, 1000) # length must either be a scalar or match index's length
df_exams['language score'] = lang_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,59
1,female,group C,some college,standard,completed,69,90,88,79
2,female,group B,master's degree,standard,none,90,95,93,93
3,male,group A,associate's degree,free/reduced,none,47,57,44,37
4,male,group C,some college,standard,none,76,78,75,66
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,10
996,male,group C,high school,free/reduced,none,62,55,55,77
997,female,group C,high school,free/reduced,completed,59,71,65,89
998,female,group D,some college,standard,completed,68,78,77,36
999,female,group D,some college,free/reduced,none,77,86,86,63

In [24]:
# Still like above, using random floats from 0 to 100
lang_score = np.random.uniform(0, 100+1, 1000) # 'high' value exclusive
df_exams['language score'] = lang_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,16.234730
1,female,group C,some college,standard,completed,69,90,88,94.045477
2,female,group B,master's degree,standard,none,90,95,93,90.040451
3,male,group A,associate's degree,free/reduced,none,47,57,44,45.528746
4,male,group C,some college,standard,none,76,78,75,66.873957
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,90.832515
996,male,group C,high school,free/reduced,none,62,55,55,24.414395
997,female,group C,high school,free/reduced,completed,59,71,65,90.038047
998,female,group D,some college,standard,completed,68,78,77,94.044196
999,female,group D,some college,free/reduced,none,77,86,86,87.146942

### Using assign()

- Add multiple columns in a single line
- For overwriting values of existing columns (best practice)

Returns a new object of the `DataFrame` with all the **original columns + the new ones**.

In [25]:
# Create random numbers for our new columns (1000 rows)
score1 = np.random.randint(1, 100, size=1000)
score2 = np.random.randint(1, 100, size=1000)

# Create series
series1 = pd.Series(score1)
series2 = pd.Series(score2)

# assign() to add multiple columns. This create a new copy for the DataFrame
df_exams.assign(score1=series1, score2=series2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,16.234730,73,14
1,female,group C,some college,standard,completed,69,90,88,94.045477,28,43
2,female,group B,master's degree,standard,none,90,95,93,90.040451,28,94
3,male,group A,associate's degree,free/reduced,none,47,57,44,45.528746,73,13
4,male,group C,some college,standard,none,76,78,75,66.873957,46,50
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,90.832515,42,12
996,male,group C,high school,free/reduced,none,62,55,55,24.414395,14,26
997,female,group C,high school,free/reduced,completed,59,71,65,90.038047,83,11
998,female,group D,some college,standard,completed,68,78,77,94.044196,39,48
999,female,group D,some college,free/reduced,none,77,86,86,87.146942,59,87

In [26]:
# The original DataFrame is NOT modified
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,16.234730
1,female,group C,some college,standard,completed,69,90,88,94.045477
2,female,group B,master's degree,standard,none,90,95,93,90.040451
3,male,group A,associate's degree,free/reduced,none,47,57,44,45.528746
4,male,group C,some college,standard,none,76,78,75,66.873957
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,90.832515
996,male,group C,high school,free/reduced,none,62,55,55,24.414395
997,female,group C,high school,free/reduced,completed,59,71,65,90.038047
998,female,group D,some college,standard,completed,68,78,77,94.044196
999,female,group D,some college,free/reduced,none,77,86,86,87.146942

### Using insert()
- Insert a new column at a specific position or index.
- Updates DataFrame in-place.

In [27]:
# insert(position, column name, Series) updates DataFrame in-place
# Fails if column name is duplicate
try:
    df_exams.insert(1, 'test_misc', series1)
except:
    pass
df_exams[["gender", "test_misc"]]

     gender  test_misc
0    female         73
1    female         28
2    female         28
3      male         73
4      male         46
..      ...        ...
995  female         42
996    male         14
997  female         83
998  female         39
999  female         59

[1000 rows x 2 columns]

## **Series: Attributes and Methods**

In [28]:
# Index
df_exams['gender'].index

RangeIndex(start=0, stop=1000, step=1)

In [29]:
df_exams['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

## **Selecting Rows**

In [30]:
# Using .iloc[] (index locator)
df_exams.loc[100]

gender                                 male
test_misc                                70
race/ethnicity                      group B
parental level of education    some college
lunch                              standard
test preparation course                none
math score                               79
reading score                            67
writing score                            67
language score                    85.863706
Name: 100, dtype: object

In [32]:
# Using .loc[] (locator)

df_exams_2 = df_exams.rename(index={0: 'A'})
df_exams_2.loc['A']

gender                                    female
test_misc                                     73
race/ethnicity                           group B
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                     none
math score                                    72
reading score                                 72
writing score                                 74
language score                          16.23473
Name: A, dtype: object